package api.util.arraylist;
/*
 	java.util.ArrayList는 오브젝트 배열을 이용해서
 	데이터를 순차적으로 저장하는 공간
 	
 	첫번째로 저장한 공간은 인덱스 0번 값을 갖는다.
 	배열에 더 이상 저장할 공간이 없으면 보다 큰 새로운 배열을 생성하여 
 	기준의 배열에 저장된 내용을 새로운 배열에 복사한 다음 저장한다.
 	
 */
/*
 	java.util.Vector와 차이점
 	벡터는 멀티스레드에 대한 동기화가 되어있으나
 	java.util.ArrayList는 동기화가 되어있지 않다.
 */
/*
 	ArrayList클래스
 1.	ArrayList와 Vector class는 List 를 크기변경 가능한 배열로 구현한 것으로 
 	차이점은 백터 클래그의 객체는 원래 기본적으로 동기화 되지만 어래이 리스트는 그렇지 않다.
2.	비 동기화 된 컬랙션은 동기화 된 컬랙션 보다 더 나은 성능을 제공하며 스레드들이 컬랙션을
	공유하지 않는 프로그램에서는 일반적으로 어레이리스트를 백터 보다 더 선호 하며
	어레이리스트는 동기화를 고려하지 않는 백터처럼 동작형으로써 쓰레드 동기화에 따르는 
	부담을 가지지 않기 때문에 백터보다 빠르게 실행한다.
 */
public class ArrayListSyntax {
	
}
