package api.util.vector;

public class GradeScenario {
	/*
	 	성적표 벡터로 작성하기 코딩 시나리오
	 	1. VO, Interface 클래스 다이어그램을 받아든다. 본인이 작성했던 오더를 받앗던
	 	일단 본인이 작성하지 않아서 잘 모르는 상황이라는 설정
	 	혹은 본인이 하더라도 짐작가는데로 설정한 기능이라는 가정하에
	 	2. vo 게터 세터 임플 을 일단 구현한다..
	 	3. 기능중에 합계를 구하는 기능이 필요
	 		필요한 것을 필드에 있는 과목 점수가 있어야 하기에 vo 기능을 내부에 넣는다.
			이정도의 유연성은 개발자에게 필요!
		4. 일단 그렇게 VO를 완성하고 임플로~
		5. 임플을 보면서 메소드를 분석하고
			그리고 주석을 자신의 방식대로 적기
			예를 들면  
			1.인풋 - 학생별로 성적을 입력을 받는지 그럼 입력받아서 저장공간이 필요하는데 
			배열이 다른 변수를 저장하는 공간인데 한번 생성하면 추가로 늘릴수 없으니 동적으로 확장하는 컬랙션 선택.
			하지만 내가 지금 아는건 백터 뿐이라 백터로 넣는다.
			2.프린트 - 출력하는것인지 보고 맞으면 vo객체의 투스트링을 이용
			3. 학번검색 - 학번으로 성적을 조회하는 기능
			학번은 겹치지 않으므로 리턴값이 문자열 일테니 백터의 포문 + 내부의 이프문 이용
			4. 이름검색 - 이름으로 성적 조회인데 리턴값이 백터이다. 복수계의 스트링을 처리하게 설계
			리턴값이 하나이든 여러개이든 포문과 이프문 구성밖에는 백터요소 출력을 할수가 없다. ㄱㄱ ㅅ
			5. 내림차순 정렬- Collection.sort 쓰면 된다 - 알게되면 처리
			6.오름차순 정렬 - Arrays.sort ㄱㄱ ㅅ
			
		메소드 마다 공유하는 다수의 값(학생이 여러명이니 )이 필요하니 한군데에 저장할 컬랙션을 필드에 선언
		필드 선언시 메소드들이 값을 공유하도록 허용
		6. 대충 완성 됫고 귀찮으니 더미는 생성자로 때려박는다.
	 */
}
